In [1]:
# load the numpy library with alias name "np"
import numpy as np
# load the pandas library with alias name "pd"
import pandas as pd

In [54]:
nse_data = pd.read_excel("C:/Users/sayan/dataset/NSE.xlsx", skiprows=5)
nse_data

,Company Name,Beta,Alpha,NIFTY closing,Date,Opening Price,High Price,Low Price,Closing Price,Adjusted Closing Price,Shares Outstanding,Market Capitalisation,Total Returns,Face Value,EPS,P/E,P/B,Yield
0,20 Microns Ltd.,1.23,-0.08,17416.55,2021-11-22,60.25,61.10,56.25,57.50,57.50,35286502.0,2028.97,-4.56,5.0,10.70,5.37,0.96,0.00
1,20Th Century Finance Corpn. Ltd. [Merged],0.61,-0.61,1160.15,1999-05-18,12.50,12.50,12.10,12.50,12.50,17470191.0,218.38,-0.79,10.0,9.63,1.30,0.12,19.20
2,3I Infotech Ltd.,1.49,0.18,17416.55,2021-11-22,89.35,89.35,89.35,89.35,89.35,164036287.0,14656.64,4.99,10.0,1.45,61.66,NaN,0.00
3,3M India Ltd.,0.90,0.21,17416.55,2021-11-22,25200.00,25600.00,25001.00,25250.90,25250.90,11265070.0,284453.16,0.23,10.0,185.40,136.20,12.29,0.00
4,3P Land Holdings Ltd.,0.92,0.09,17416.55,2021-11-22,13.95,13.95,12.75,12.85,12.85,18000000.0,231.30,-4.10,2.0,0.02,771.00,0.47,0.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6574,Zuari Forex Ltd. (1988) [Merged],0.34,1.21,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6575,Zuari Global Ltd.,1.78,-0.18,17416.55,2021-11-22,142.90,144.00,133.00,135.35,135.35,29440604.0,3984.79,-3.22,10.0,16.09,8.41,0.18,1.48
6576,Zyden Gentec Ltd.,1.01,-0.15,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6577,Zydus Wellness Ltd.,0.64,0.29,17416.55,2021-11-22,2034.00,2034.10,1981.05,2015.85,2015.85,63632144.0,128272.86,-0.15,10.0,-24.53,NaN,3.23,0.25
6578,Zylog Systems Ltd.,0.50,-0.79,11189.20,2019-07-29,0.35,0.35,0.35,0.35,0.35,58992840.0,20.65,-12.50,5.0,0.26,1.35,NaN,0.00

In [56]:
nse_data.columns = nse_data.columns.str.lower().str.replace(' ','').str.replace('/','_')

In [57]:
nse_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6579 entries, 0 to 6578
Data columns (total 18 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   companyname           6579 non-null   object
 1   beta                  6306 non-null   float64
 2   alpha                 6306 non-null   float64
 3   niftyclosing          3195 non-null   float64
 4   date                  3195 non-null   datetime64[ns]
 5   openingprice          3195 non-null   float64
 6   highprice             3195 non-null   float64
 7   lowprice              3195 non-null   float64
 8   closingprice          3195 non-null   float64
 9   adjustedclosingprice  3195 non-null   float64
 10  sharesoutstanding     3181 non-null   float64
 11  marketcapitalisation  3189 non-null   float64
 12  totalreturns          3195 non-null   float64
 13  facevalue             3181 non-null   float64
 14  eps                   2981 non-null   float64
 15  p_e                   1845 non-null   float64
 16  p_b                   2647 non-null   float64
 17  yield                 3189 non-null   float64
dtypes: datetime64[ns](1), float64(16), object(1)
memory usage: 925.3+ KB

In [59]:
mean_value = nse_data['beta'].mean()
mean_value

0.8230764351411357

In [4]:
india_news = pd.read_csv('C:/Users/sayan/dataset/india-news-headlines-short.csv')

In [5]:
india_news

,Unnamed: 0,publish_date,headline_category,headline_text
0,0,20010102,unknown,Status quo will not be disturbed at Ayodhya; s...
1,1,20010102,unknown,Fissures in Hurriyat over Pak visit
2,2,20010102,unknown,America's unwanted heading for India?
3,3,20010102,unknown,For bigwigs; it is destination Goa
4,4,20010102,unknown,Extra buses to clear tourist traffic
...,...,...,...,...
3995,3995,20010505,unknown,90;000 MSU marksheets had a spelling mistake!
3996,3996,20010505,unknown,Another sandalwood tree felled on MSU campus
3997,3997,20010505,unknown,Another case of CAS violation on MSU campus
3998,3998,20010505,unknown,Petrol becomes cheaper; diesel dearer
3999,3999,20010505,unknown,Probe ordered into death of sparrows

In [20]:
# Renaming columns
# use rename method for pands objects
print("Column names before rename : \n", india_news.columns)

# renaming column names
india_news = india_news.rename(
     columns= {
         "publish_date" : "publish_date",
         "category" : "headline_category",
         "headline" : "headline_text"
     }
)

print("Column names after rename : \n", india_news.columns)

Column names before rename :
 Index(['Unnamed: 0', 'publish_date', 'category', 'headline'], dtype='object')
Column names after rename :
 Index(['Unnamed: 0', 'publish_date', 'headline_category', 'headline_text'], dtype='object')

In [22]:
category = india_news['headline_category']

print(category)

0       unknown
1       unknown
2       unknown
3       unknown
4       unknown
         ...
3995    unknown
3996    unknown
3997    unknown
3998    unknown
3999    unknown
Name: headline_category, Length: 4000, dtype: object

In [9]:
headline= india_news['headline_text']
headline

0       Status quo will not be disturbed at Ayodhya; s...
1                     Fissures in Hurriyat over Pak visit
2                   America's unwanted heading for India?
3                      For bigwigs; it is destination Goa
4                    Extra buses to clear tourist traffic
                              ...
3995        90;000 MSU marksheets had a spelling mistake!
3996         Another sandalwood tree felled on MSU campus
3997          Another case of CAS violation on MSU campus
3998                Petrol becomes cheaper; diesel dearer
3999                 Probe ordered into death of sparrows
Name: headline_text, Length: 4000, dtype: object

In [7]:
line= india_news['headline_text'].sample()
line

2242    Colours of Spring
Name: headline_text, dtype: object

In [9]:
line.str.upper()

2242    COLOURS OF SPRING
Name: headline_text, dtype: object

In [12]:
india_news.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         4000 non-null   int64
 1   publish_date       4000 non-null   int64
 2   headline_category  4000 non-null   object
 3   headline_text      4000 non-null   object
dtypes: int64(2), object(2)
memory usage: 125.1+ KB

In [15]:
print(line)
len(line)

2242    Colours of Spring
Name: headline_text, dtype: object

1

In [18]:
india_news['headline_text'].str[0:6]

0       Status
1       Fissur
2       Americ
3       For bi
4       Extra
         ...
3995    90;000
3996    Anothe
3997    Anothe
3998    Petrol
3999    Probe
Name: headline_text, Length: 4000, dtype: object

In [27]:
# boolean series returned
count=india_news["headline_text"].str.upper().str.startswith("The")

sum(count)

0

In [46]:
print(line)

line1 = line.str.split(" ")

line1

2242    Colours of Spring
Name: headline_text, dtype: object

2242    [Colours, of, Spring]
Name: headline_text, dtype: object

In [48]:
GFG_dict = { 'G1': [10, 20,30,40],
                'G2': [25, np.NaN, np.NaN, 29],
                'G3': [15, 14, 17, 11],
                'G4': [21, 22, 23, 25]}

In [50]:
# Create a DataFrame from dictionary
gfg = pd.DataFrame(GFG_dict)
gfg

   G1    G2  G3  G4
0  10  25.0  15  21
1  20   NaN  14  22
2  30   NaN  17  23
3  40  29.0  11  25

In [52]:
#Finding the mean of the column having NaN
mean_value=gfg['G2'].mean()
mean_value

27.0

In [53]:
gfg['G2'].fillna(value=mean_value, inplace=True)
print('Updated Dataframe:')
print(gfg)

Updated Dataframe:
   G1    G2  G3  G4
0  10  25.0  15  21
1  20  27.0  14  22
2  30  27.0  17  23
3  40  29.0  11  25